#### 📖 Terraform Plan ('infra/resources/prod/italynorth') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.commons.module.core_cosmosdb_containers["history"].azurerm_cosmosdb_sql_container.this will be created
  + resource "azurerm_cosmosdb_sql_container" "this" {
      + account_name        = "ts-p-itn-trial-account-01"
      + database_name       = "db"
      + default_ttl         = (known after apply)
      + id                  = (known after apply)
      + name                = "history"
      + partition_key_path  = "/latestId"
      + resource_group_name = "ts-p-itn-data-rg-01"
      + throughput          = (known after apply)

      + autoscale_settings {
          + max_throughput = 1000
        }
    }

  # module.commons.module.core_cosmosdb_containers["latest"].azurerm_cosmosdb_sql_container.this will be created
  + resource "azurerm_cosmosdb_sql_container" "this" {
      + account_name        = "ts-p-itn-trial-account-01"
      + database_name       = "db"
      + default_ttl         = (known after apply)
      + id                  = (known after apply)
      + name                = "latest"
      + partition_key_path  = "/id"
      + resource_group_name = "ts-p-itn-data-rg-01"
      + throughput          = (known after apply)

      + autoscale_settings {
          + max_throughput = 1000
        }
    }

  # module.commons.module.subscription_async_fn.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ enabled             = false -> true
        id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Insights/metricAlerts/[ts-trial | ts-p-itn-subscription-async-fn-01] Health Check Failed"
        name                = "[ts-trial | ts-p-itn-subscription-async-fn-01] Health Check Failed"
        tags                = {}
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.commons.module.subscription_async_fn.azurerm_service_plan.this[0] will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                           = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/serverFarms/ts-p-itn-subscription-async-fn-01-plan"
        name                         = "ts-p-itn-subscription-async-fn-01-plan"
        tags                         = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
      ~ worker_count                 = 1 -> 2
        # (9 unchanged attributes hidden)
    }

  # module.commons.module.subscription_fn.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ enabled             = false -> true
        id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-subscription-rg-01/providers/Microsoft.Insights/metricAlerts/[ts-trial | ts-p-itn-subscription-fn-01] Health Check Failed"
        name                = "[ts-trial | ts-p-itn-subscription-fn-01] Health Check Failed"
        tags                = {}
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.commons.module.key_vault.azurerm_monitor_diagnostic_setting.key_vault,
  on .terraform/modules/commons.key_vault/key_vault/main.tf line 55, in resource "azurerm_monitor_diagnostic_setting" "key_vault":
  55: resource "azurerm_monitor_diagnostic_setting" "key_vault" {

`retention_policy` has been deprecated in favor of
`azurerm_storage_management_policy` resource - to learn more
https://aka.ms/diagnostic_settings_log_retention

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
